app/controllers/ads_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def set_ads
    @event = Event.find(params[:event_id])