app/controllers/events_controller.rb

INSERT INTO "events" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Tara's Event"], ["description", ""], ["created_at", "2017-04-24 15:34:02.494020"], ["updated_at", "2017-04-24 15:34:02.494020"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "description" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["description", "Jayme Moen Jr."], ["updated_at", "2017-04-24 22:15:01.446785"], ["id", 24]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)